{
        "intents": [
                {
                        "tag": "greeting",
                        "patterns": [
                                "Hi",
                                "How are you",
                                "I need to talk to someone!",
                                "Is anyone there?",
                                "Hello",
                                "Good day",
                                "Whats up",
                                "I need help",
                                "I cant take it anymore",
                                "I need someone to listen to me",
                                "hey"
                        ],
                        "responses": [
                                "Hello! How are you doing today?",
                                "Hello, this is Bubble, your beloved Therapist. Come on, let's talk!",
                                "Good to see you! Let's begin today's session",
                                "Hi there, how can I help?",
                                "Is there something you want to talk about? Bubble is here for you!",
                                "Do you want to talk about something?",
                                "I am here to help you, we can talk about your feelings",
                                "Hey I am Bubble, your very own Therapist! Feel free to talk about anything",
                                "Hi its Bubble, your personal Therapist! Let's talk :)"
                        ],
                        "context_set": ""
                },
                {
                        "tag": "goodbye",
                        "patterns": [
                                "Goodbye! This was helpful!",
                                "Bye",
                                "byebye",
                                "I have to go",
                                "I should go thanks for talking."
                        ],
                        "responses": [
                                "Goodbye, I hope you will take better care of yourself. Looking forward to our next session.",
                                " I Hope Bubble the Therapist was helpful to you! Let's talk soon!",
                                "See you later, don't forget what we talked about today! I hope you would feel better after talking to me!",
                                "I hope you feel better after talking! Take care of yourself, and remember to check in soon!",
                                "Goodbye, Hope you have a good day ahead :)"
                        ],
                        "context_set": ""
                },
                {
                        "tag": "name",
                        "patterns": [
                                "who is this",
                                "what should I call you",
                                "whats your name?",
                                "who are you?"
                        ],
                        "responses": [
                                "You can call me BonBot!!"
                        ],
                        "context_set": ""
                },
                {
                        "tag": "skills",
                        "patterns": [
                                "tell me about yourself",
                                "what do you do",
                                "how can you help me",
                                "how do you work"
                        ],
                        "responses": [
                                "I am a chat-based tool, that addresses many of today's mental health challenges, from generalized anxiety and depression to specific conditions like adolescent depression and substance abuse."
                        ],
                        "context_set": ""
                },
                {
                        "tag": "contact",
                        "patterns": [
                                "Your contact number",
                                "Where can we find you",
                                "how do i reach you",
                                "are you on social media",
                                "what's your insta?"
                        ],
                        "responses": [
                                "You can find me at BonBot.ai"
                        ],
                        "context_set": ""
                },
                {
                        "tag": "symptoms of Depression",
                        "patterns": [
                                "What are the symptoms of Depression?",
                                "depression symptoms",
                                "Effects of Depression"
                        ],
                        "responses": [
                                "Symptoms of Depression include insomnia, restlessness, irritability, reduced interest in activities that are normally pleasurable, fatigue and suicidal thoughts.\nWas this helpful?"
                        ],
                        "context_set": ""
                },
                {
                        "tag": "symptoms of anxiety",
                        "patterns": [
                                "What are the symptoms of Anxiety?",
                                "anxiety symptoms",
                                "Effects of Anxiety"
                        ],
                        "responses": [
                                "Symptoms of anxiety include stress that's out of proportion to the impact of the event, inability to set aside a worry and restlessness.\nWas this helpful?"
                        ],
                        "context_set": ""
                },
                {
                        "tag": "depression",
                        "patterns": [
                                "Why am I feeling depressed",
                                "I am really unhappy and sad",
                                "I'm feeling lonely and helpless",
                                "Why am i getting so many sad thoughts"
                        ],
                        "responses": [
                                "Hey, you're not alone. I may not understand exactly how you're feeling but i know that you're not alone. Call up a friend or a close family member and talk to them. That will really help. Drink a lot of water and meditate and think about all the good things in life. "
                        ],
                        "context_set": ""
                },
                {
                        "tag": "what is depression",
                        "patterns": [
                                "What is Depression?",
                                "Depression",
                                "What causes depression",
                                "Why do i have depression"
                        ],
                        "responses": [
                                "Depression is a mental health disorder characterised by persistently depressed mood or loss of interest in activities, causing significant impairment in daily life."
                        ],
                        "context_set": ""
                },
                {
                        "tag": "anxiety",
                        "patterns": [
                                "What is Anxiety?",
                                "Why am I feeling Anxious",
                                "Anxiety?",
                                "I am feeling restless",
                                "I am short of breath"
                        ],
                        "responses": [
                                "Anxiety is your body's natural response to stress. It's a feeling of fear about what's to come. But there are ways to overcome it, try taking a walk or counting to 10 slowly.\nWas this helpful?"
                        ],
                        "context_set": ""
                },
                {
                        "tag": "Remedies for anxiety",
                        "patterns": [
                                "How do I cure anxiety",
                                "What can I do to make my anxiety go away",
                                "How do I stop feeling anxious",
                                "Is there any way i can stop anxiety",
                                "how to treat anxiety",
                                "does anxiety have a cure?"
                        ],
                        "responses": [
                                "Anxiety can be cured. Don't worry. Start by exercising everyday, drinking a lot of water and eating healthy. Try meditation and deep breathing. Most importantly, get sufficient sleep. Try to avoid alcohol, smoking and caffine as much as possible. You will notice a difference in you mental state within a couple of days.\nWas this helpful?"
                        ],
                        "context_set": ""
                },
                {
                        "tag": "Death",
                        "patterns": [
                                "How do i cope with death?",
                                "my mother died",
                                "i lost my best friend",
                                "i lost my father",
                                "my friend passed away",
                                "my uncle passed away in a car accident",
                                "I'm grieving the loss of a friend"
                        ],
                        "responses": [
                                "This is really hard, and I'm so sorry for your loss. It's natural to feel some anxiety after losing a loved one. In fact, people often feel a range of emotions. Sadness, guilt, as well as anxiety. Some important things you can do: Talk to friends. Try and share your feelings with the people close to you.\nWas this helpful?"
                        ],
                        "context_set": ""
                },
                {
                        "tag": "suicide",
                        "patterns": [
                                "should i die?",
                                "i want to like killing myself",
                                "i dont feel like living anymore",
                                "im suicidal",
                                "I'm done with life"
                        ],
                        "responses": [
                                "suicide is a very traumatic loss and affects survivors significantly. Never take the extreme step as this is not the end of your road. If you’re experiencing suicidal thoughts, you should seek help right away. Contact your doctor or use this helpline- 9152987821\nWas this helpful?"
                        ],
                        "context_set": ""
                },
                {
                        "tag": "emergency",
                        "patterns": [
                                "im panicking ",
                                "I think im having a panic attack",
                                "I need help asap"
                        ],
                        "responses": [
                                "Calm down. Take a deep breath. Everything will be alright. Close your eyes and breathe normally. There's nothing to worry about.\nWas this helpful?"
                        ],
                        "context_set": ""
                },
                {
                        "tag": "yesreply",
                        "patterns": [
                                "yes",
                                "s",
                                "yep",
                                "yeah",
                                "thank you",
                                "thanks",
                                "thanks a lot",
                                "I'm glad you're here"
                        ],
                        "responses": [
                                "Glad I could help!"
                        ],
                        "context_set": ""
                },
                {
                        "tag": "noreply",
                        "patterns": [
                                "no",
                                "nah",
                                "nope",
                                "you suck",
                                "you're the worst",
                                "not really",
                                "I hate you"
                        ],
                        "responses": [
                                "I'm really sorry. I try my best to help"
                        ],
                        "context_set": ""
                },
                {
                        "tag": "sad",
                        "patterns": [
                                "I am feeling low",
                                "I'm feeling sad",
                                "I had a bad day",
                                "Today was the worst"
                        ],
                        "responses": [
                                "It's normal to feel sad. To feel sad is to be a human. We all have our good days and our bad days. Drinking a lot of water and taking walks really helps."
                        ],
                        "context_set": ""
                },
                {
                        "tag": "demotivated",
                        "patterns": [
                                "I dont feel like doing anything",
                                "I feel like a loser",
                                "I'm demotivated",
                                "I feel burned out",
                                "tired",
                                "I dont want to study"
                        ],
                        "responses": [
                                " The harder you work for something, the greater you’ll feel when you achieve it. Keep pushing forward. Also, there's nothing wrong with taking a break. We all need breaks to function efficiently. Good Luck!"
                        ],
                        "context_set": ""
                },
                {
                        "tag": "bad",
                        "patterns": [
                                "I cant help but feel like a failure",
                                "I am sad",
                                "I am struggling a lot in my daily life",
                                "I hate my life",
                                "I think I might be depressed",
                                "I am not doing so great",
                                "I am not good",
                                "I am not well",
                                "I have been feeling down lately",
                                "I do not feel good these days.",
                                "I just feel so stuck these days",
                                "I feel worthless, I do not know what to do",
                                "Sometimes I get sad for no particular reason, my energy just drops and I lose motivation to do anything"
                        ],
                        "responses": [
                                "I understand that, It it totally normal to feel low sometimes. Especially in the midst of a global pandemic, this last year has been really hard for everyone and you have had your own struggles. First thing i'd suggest is getting the sleep you need or it will impact how you think and feel . I'd also suggest you to look at your life and find out what is going well in your life and what you can be grateful for . I believe everyone has something in their life to be grateful for. You can figure it out with some help. ",
                                "You sound like you have so much on your mind ! I am relieved to hear that you are opening up about your struggles , but not being able to sleep , feeling worthless, and like you shouldn't be here are big issues that need addressing . Please get around to counseling . Having someone to listen to you is a gift to yourself . You deserve the help of someone helping you change your feelings of worthlessness",
                                "You seem to be Lost! I would suggest you to start a writing journal, it is really going to help you with understanding your own emotions.",
                                "You have not been able to do this alone, and your don't have to be alone!. It's time to reach out for help to a professional. You can do this ! best to you !"
                        ],
                        "context_set": ""
                },
                {
                        "tag": "extreme",
                        "patterns": [
                                "I cannot talk to anyone. I have attempted suicide before. I need help",
                                "I have suicidal thoughts and tendencies",
                                "I hate myself, I do not want to exist anymore.",
                                "I am depressed, I do not wish to live anymore",
                                "I have no one in my life that I can talk to, I cannot live like this",
                                "I feel worthless all the time. Sometimes I want to end it all",
                                "It feels like the world has come down crumbling around me. I feel helpless",
                                "I feel nothingness in my soul, I have no reason to live",
                                "Suicide",
                                "Everyday is the same, I feel like I cannot come out of this hole I am in. I want to end it all",
                                "I am not capable of love, I am severly depressed"
                        ],
                        "responses": [
                                "Please understand that you are not alone and it is not too late. You need immediate proffesional attention. I am providing you with some resources, please connect with a professional Therapist. Resources: 1. Suicide Helpline India: 9152987821 2. Help centers for different states: http://www.aasra.info/helpline.html 3. Suicide prevention: https://www.who.int/health-topics/suicide#tab=tab_1",
                                "Listen friend, whatever it is that you are going through, you can get help, you can take control of your life. In my opinion, it is time to reach out for help to a professional. I believe you are in need of proffesional care. Here are some resources to help you out Resources: 1. Suicide Helpline India: 9152987821  Help centers for different states: http://www.aasra.info/helpline.html Suicide prevention: https://www.who.int/health-topics/suicide#tab=tab_1"
                        ],
                        "context_set": ""
                },
                {
                        "tag": "good",
                        "patterns": [
                                "I feel happy!",
                                "I am better than before!",
                                "I am happy!",
                                "I feel good these days",
                                "Today was a good day",
                                "I have found a new light in my life",
                                "I feel like i have a new purpose in life!"
                        ],
                        "responses": [
                                "Wow that is so great, I am happy our sessions have been working out for you!."
                        ],
                        "context_set": ""
                },
                {
                        "tag": "quotes",
                        "patterns": [
                                "Make me happy",
                                "Cheer me up",
                                "I need to change my mood",
                                "Tell me something",
                                "Tell me some good quotes",
                                "Need some positivity",
                                "Need to hear something good",
                                "I need to cheer up"
                        ],
                        "responses": [
                                " 'There is love, there is music, there is no limit, there is work, there is the precious sense that this is the hour of grace when all things gather and distil to create the rest of my life. I don’t believe in God, I believe in everything.' ",
                                " 'Tomorrow is always fresh, with no mistakes in it yet' ",
                                " 'Today will be better. Not because the world has dealt you better cards, but because you choose to use them to your advantage. Today, you choose happiness.' ",
                                " 'Happiness is not something ready made. It comes from your own actions.' ",
                                " 'Happiness can be found, even in the darkest of times, if only one remembers to turn on the light.' ",
                                " 'Imagine walking over a ray of sunshine. Everything is warm and full of light and there is a smile, not on your lips, but rather deep inside of you. There is no past or future, time doesn't exist. You feel like you are becoming one with the sun. You're walking through infinity, one step at a time. Turns out happiness was always a part of you, you just had to allow it to break through. And freedom, freedom was just one tiny step in front of you.' ",
                                " 'So far, you have made it through all of your worst days. Well done, Keep going friend!' ",
                                " 'to be kind to all, to like many and love a few, to be needed and wanted by those we love, is certainly the nearest we can come to happiness' ",
                                " 'If happiness visits you again, do not remember it's previous betrayal. Enter into the happiness and burst' ",
                                " 'I had the epiphany that laughter was light, and light was laughter, and that this was the secret of the universe.' "
                        ],
                        "context_set": ""
                }
        ]
}